app/controllers/admin/reports_controller.rb

SELECT "deals".* FROM "deals"
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def index
    params[:selected_date_filter_type] ||= "current"
    @q = Deal.metasearch(params[:search])
    @deals = @q.all
    generated_and_redeemed_deals
#    @deals_view_users = @deals.collect{|deal| deal.generated_coupons}
#    @deals_view_users = @deals_view_users.flatten
    @user = User.find(params[:search][:user_current_store]) rescue ""