app/views/users/_form.html.erb

              <%= f.fields_for :user_categories do |category_builder| %>
                <%= category_builder.collection_select :category_id, Category.all, :id, :name %>
---
SELECT "categories".* FROM "categories"

                  <% counter=0 %>
                  <% Plan.find_all_by_plan_type('s').each do |plan| %>
---
SELECT "plans".* FROM "plans" WHERE "plans"."plan_type" = 's'