app/views/users/switch.html.erb

SELECT "users".* FROM "users" INNER JOIN "user_zones" ON "user_zones"."user_id" = "users"."id" WHERE "user_zones"."zone_id" IS NULL
---
        <div id="uniform-users">
          <%=select_tag "switch_users", options_for_select(User.find( :all, :joins => :user_zones,:conditions => { :user_zones => { :zone_id => params[:zone] } }).collect{ |u| [u.business_name, u.id] }),prompt: 'Select a Retailer',style: "opacity:1;" %>