app/views/admin/classifieds/_form.html.erb

SELECT "admin_classified_categories".* FROM "admin_classified_categories"
---
            <label for="classifieds" class="static" style="vertical-align:top;">Category:</label>
            <%= f.collection_select :classified_category_id, Admin::ClassifiedCategory.all, :id, :name %>