app/controllers/temp_images_controller.rb

  def set_form
    session[:back_img_color] = params[:temp_image][:back_img_color] if params[:temp_image][:back_img_color].present?
---
SELECT "temp_images".* FROM "temp_images" WHERE "temp_images"."session_id" = 'b93dba3bfe08dd8c49130ad182cfdbab' LIMIT 1