app/controllers/users_controller.rb

  def index
    @users = User.where(:role_id => Role::SITE_USER_ID)
---
SELECT "users".* FROM "users" WHERE "users"."role_id" = 2

  def show
    @user = User.find(params[:id])
    @credit_card_information = CreditCardInformation.find_by_user_id(@user.id)

    @user_payments = @user.user_paymentss.where(['end_date >=?',Time.zone.now]).order(:id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "credit_card_informations".* FROM "credit_card_informations" WHERE "credit_card_informations"."user_id" = 1 LIMIT 1
SELECT "user_payments".* FROM "user_payments" WHERE "user_payments"."user_id" = 1 AND (end_date >='2013-04-11 11:40:59.312743') ORDER BY id

  def switch
     unless params[:zone].nil?
        unless params[:user].nil?
          cookies[:remember_admin_id] = current_user.id

          sign_in :user, User.find(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1